In [1]:
import pandas as pd

In [4]:
data = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Carol', 'David', 'Eve'],
    'Age': [20, 22, 19, 21, 20],
    'Gender': ['Female', 'Male', 'Female', 'Male', 'Female'],
    'Marks': [85, 78, 92, 74, 88]
})

1. Using the DataFrame from Task 2, write a Python program to:

A. Select and display the Name and Marks columns.

In [5]:
data[['Name', 'Marks']]

    Name  Marks
0  Alice     85
1    Bob     78
2  Carol     92
3  David     74
4    Eve     88

B. Filter and display records where Marks > 80.

In [6]:
data[data['Marks'] > 80]

    Name  Age  Gender  Marks
0  Alice   20  Female     85
2  Carol   19  Female     92
4    Eve   20  Female     88

C. Display the record of the student with the highest marks

In [7]:
data[data['Marks'] == data['Marks'].max()]

    Name  Age  Gender  Marks
2  Carol   19  Female     92